[Killed] BlockStatement
mutation.js:2:24
 // 1. Killed – mutação simples que será pega pelo teste
-function isPositive(n) {
-	return n > 0;
-}
+function isPositive(n) {}
 
 // 2. Survived – mutação vai escapar do teste fraco
killedBy: isPositive retorna true para positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
mutation.js:3:9
 // 1. Killed – mutação simples que será pega pelo teste
 function isPositive(n) {
-	return n > 0;
+	return false;
 }
 
killedBy: isPositive retorna true para positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
mutation.js:3:9
 // 1. Killed – mutação simples que será pega pelo teste
 function isPositive(n) {
-	return n > 0;
+	return n <= 0;
 }
 
killedBy: isPositive retorna true para positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
mutation.js:7:20
 }
 
 // 2. Survived – mutação vai escapar do teste fraco
-function isEven(n) {
-	return n % 2 === 0;
-}
+function isEven(n) {}
 
 // 3. No coverage – sem nenhum teste
killedBy: isEven retorna true para pares (mas não testa ímpares)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ArithmeticOperator
mutation.js:8:9
 
 // 2. Survived – mutação vai escapar do teste fraco
 function isEven(n) {
-	return n % 2 === 0;
+	return n * 2 === 0;
 }
 
killedBy: isEven retorna true para pares (mas não testa ímpares)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] BlockStatement
mutation.js:12:25
 }
 
 // 3. No coverage – sem nenhum teste
-function multiply(a, b) {
-	return a * b;
-}
+function multiply(a, b) {}
 
 // 4. Timeout – mutação poderá causar loop infinito

[Killed] BlockStatement
mutation.js:17:27
 }
 
 // 4. Timeout – mutação poderá causar loop infinito
-function hangIfTrue(cond) {
-	if (cond) {
-		while (true) {} // Mutação aqui trava o processo
-	}
-	return true;
-}
+function hangIfTrue(cond) {}
 
 // 5. Runtime error – mutação pode gerar exceção não tratada
killedBy: hangIfTrue retorna true para false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[NoCoverage] BlockStatement
mutation.js:18:12
 
 // 4. Timeout – mutação poderá causar loop infinito
 function hangIfTrue(cond) {
-	if (cond) {
-		while (true) {} // Mutação aqui trava o processo
-	}
+	if (cond) {}
 	return true;
 }

[Survived] ConditionalExpression
mutation.js:18:6
 
 // 4. Timeout – mutação poderá causar loop infinito
 function hangIfTrue(cond) {
-	if (cond) {
+	if (false) {
 		while (true) {} // Mutação aqui trava o processo
 	}

[NoCoverage] BooleanLiteral
mutation.js:19:10
 // 4. Timeout – mutação poderá causar loop infinito
 function hangIfTrue(cond) {
 	if (cond) {
-		while (true) {} // Mutação aqui trava o processo
+		while (false) {} // Mutação aqui trava o processo
 	}
 	return true;

[Killed] BlockStatement
mutation.js:25:25
 }
 
 // 5. Runtime error – mutação pode gerar exceção não tratada
-function crashIfZero(n) {
-	return n === 0 ? foo.bar.baz : n; // erro se n == 0
-}
+function crashIfZero(n) {}
 
 // 6. Compile error – mutação pode tornar o código inválido
killedBy: crashIfZero retorna valor ou erro
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] EqualityOperator
mutation.js:26:9
 
 // 5. Runtime error – mutação pode gerar exceção não tratada
 function crashIfZero(n) {
-	return n === 0 ? foo.bar.baz : n; // erro se n == 0
+	return n !== 0 ? foo.bar.baz : n; // erro se n == 0
 }
 
killedBy: crashIfZero retorna valor ou erro
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
mutation.js:26:9
 
 // 5. Runtime error – mutação pode gerar exceção não tratada
 function crashIfZero(n) {
-	return n === 0 ? foo.bar.baz : n; // erro se n == 0
+	return false ? foo.bar.baz : n; // erro se n == 0
 }
 
killedBy: crashIfZero retorna valor ou erro
statusReason: Error: expect(received).toThrow()

Received function did not throw

[NoCoverage] BlockStatement
mutation.js:30:26
 }
 
 // 6. Compile error – mutação pode tornar o código inválido
-function invalidSyntax() {
-	return eval('return ===;'); // não pode ser parseado corretamente
-}
+function invalidSyntax() {}
 
 // 7. Ignored – função ignorada manualmente

[NoCoverage] StringLiteral
mutation.js:31:14
 
 // 6. Compile error – mutação pode tornar o código inválido
 function invalidSyntax() {
-	return eval('return ===;'); // não pode ser parseado corretamente
+	return eval(""); // não pode ser parseado corretamente
 }
 

[NoCoverage] BlockStatement
mutation.js:35:28
 }
 
 // 7. Ignored – função ignorada manualmente
-function ignoredFunction() {
-	return 42;
-}
+function ignoredFunction() {}
 
 module.exports = {
